Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/starting_work_and_changing_job/training_and_looking_for_work/looking_for_work_education_and_training.html.txt.tmx
Source language: en
Languages: ga

source: Looking for work: education and training
ga: Ag lorg oibre: oideachas agus oiliúint

source: If you are about to lose your job or if you are unemployed you could consider going back to education or training
ga: Má tá tú ar tí do phost a chailleadh nó má tá tú dífhostaithe, d'fhéadfá breathnú ar filleadh ar oideachas nó ar oiliúint

source: You can continue your education or take part in a training course in order to develop your skills, either within the formal school and college system or outside of it
ga: Is féidir leanúint le do chuid oideachais nó páirt a ghlacadh i gcúrsa oiliúna chun do chuid scileanna a fhorbairt, laistigh de chóras na scoile agus na gcoláistí nó lasmuigh de

source: Qualifax provides comprehensive information on further and higher education and training courses
ga: Tugann Qualifax eolas cuimsitheach ar bhreis oideachais agus ardoideachais agus ar chúrsaí oiliúna

source: They include different types of courses some of which lead to qualifications while others do not
ga: Ina measc tá cineálacha éagsúla de chúrsaí a bhfuil cáilíochtaí mar thoradh ar roinnt acu cé nach bhfuil cáilíochta ag roinnt eile

source: The database includes information for adult learners and recognition of prior learning with links to college and other education/training websites
ga: Cuimsíonn an bunachar sonraí faisnéis d'fhoghlaimeoirí fásta agus aitheantas do réamhfhoghlaim a bhfuil naisc orthu le láithreáin ghréasáin choláistí agus oideachais/oiliúna eile

source: Training and education courses for unemployed people
ga: Oiliúint agus cúrsaí oideachais do dhaoine dífhostaithe

source: The Springboard Programme provides higher education places for unemployed people on a range of part-time courses from Levels 6 to 9 on the National Framework of Qualifications
ga: Cuireann an Clár Springboard áiteanna ardoideachais do dhaoine dífhostaithe ar raon cúrsaí páirtaimseartha ó Leibhéal 6 go Leibhéal 9 ar an gCreatlach Náisiúnta Cáilíochtaí

source: Momentum provides free education and training projects to allow long-term jobseekers (who are unemployed for 12 months or more) to gain skills and to access work opportunities in identified growing sectors
ga: Cuireann Momentum tionscadail saoroideachais agus oiliúna ar fáil do chuardaitheoirí fadtéarmacha poist (atá dífhostaithe ar feadh 12 mhí nó níos mó)

source: The programmes include on-the job training in the form of work experience modules as well as the development of the workplace skills required to obtain and retain employment
ga: Cuimseoidh na cláir oiliúint sa láthair oibre i bhfoirm modúl taithí oibre mar aon le forbairt na scileanna láthair oibre a theastaíonn chun fostaíocht a fháil agus a choimeád

source: More information is available in our document on Momentum
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméad faoi Momentum

source: Skillstowork.ie is a guide for jobseekers and employers to the following Government skills initiatives – Springboard, Momentum, JobBridge, JobsPlus and Skillnets
ga: Is ea Skillstowork.ie treoir do chuardaitheoirí poist agus d’fhostóirí faoi na tionscnaimh Rialtais mar a leanas – Springboard, Momentum, JobBridge, JobsPlus agus Skillnets

source: The Back to Education Programme can support people getting a social welfare payment to access second-level and third-level education
ga: Is féidir leis an gClár um Fhilleadh ar Oideachas tacú le daoine atá ag fáil íocaíocht leasa shóisialaigh rochtain a bheith acu ar oideachas dara leibhéal agus tríú leibhéal

source: The Part-Time Education Option allows you to keep your Jobseeker's Allowance or Jobseeker's Benefit and attend a part-time day or evening course that will improve your chances of getting a job
ga: Ceadaíonn an Rogha Oideachais Páirtaimseartha thú Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist a choinneáil agus freastal ar chúrsa lae páirtaimseartha nó tráthnóna a chuirfidh feabhas ar do sheans post a fháil

source: The Education, Training and Development Option allows you to keep your jobseeker’s payment and attend a course not covered by the standard Back to Education Allowance, such as a personal development course
ga: Ceadaíonn an Rogha Oideachais, Oiliúna agus Forbartha thú d’íocaíocht cuardaitheora poist a choinneáil agus freastal ar chúrsa nach bhfuil clúdaithe ag an ngnáth Liúntas um Fhilleadh ar Oideachas, cosúil le cúrsa forbartha pearsanta

source: You don't need formal qualifications in order to take part in many of the full-time and part-time courses that are on offer in the adult education and community education sectors
ga: Ní gá duit cáilíochtaí foirmiúla a bheith agat chun páirt a ghlacadh in an-chuid de na cúrsaí lánaimseartha agus páirtaimseartha atá ar fáil sna hearnálacha oideachais aosaigh agus oideachais phobail

source: Adult education courses can include further and third-level education or continuing education and training
ga: Is féidir le cúrsaí oideachais aosaigh breis oideachas nó oideachas tríú leibhéal nó oideachas agus oiliúint leanúnach a chuimsiú

source: The range of courses available includes both part-time and full-time courses
ga: Áirítear an raon de chúrsaí ar fáil cúrsaí páirtaimseartha agus lánaimseartha araon

source: Community education refers to adult education and learning, generally outside the formal education sector
ga: Tagraíonn oideachas pobail d’oideachas agus d’fhoghlaim aosach, taobh amuigh d'earnáil an oideachais fhoirmiúil go ginearálta

source: It promotes personalised learning and flexibility within the learning group
ga: Cuireann sé foghlaim phearsantaithe agus solúbthacht chun cinn laistigh den ghrúpa foghlama

source: There are a number of sources of information on returning to education which can tell you more about the courses which may be available to you
ga: Tá roinnt foinsí eolais maidir le filleadh ar oideachas agus is féidir tuilleadh eolais a thabhairt duit ar na cúrsaí a d'fhéadfadh a bheith ar fáil duit

source: The Education and Training Boards (ETBs), SOLAS and other agencies fund a number of continuing education and training programmes
ga: Tugann na Boird Oideachais agus Oiliúna (BOO), SOLAS agus gníomhaireachtaí eile maoiniú do roinnt cláir oideachas agus oiliúna leanúnacha

source: ETBs organise second-level, adult, community and second chance education
ga: Eagraíonn BOO oideachas dara-leibhéal, oideachas do dhaoine fásta, oideachas pobail agus oideachas athdheise

source: You can contact your local ETB for more details
ga: Is féidir leat teagmháil a dhéanamh le do BOO áitiúil le haghaidh tuilleadh sonraí

source: They also operate the Vocational Training and Opportunities Scheme (VTOS) which provides a range of courses to meet the education and training needs of unemployed people
ga: Oibríonn siad an Scéim Oiliúna agus Deiseanna Gairmoideachais (SODG) freisin a chuireann réimse cúrsaí ar fáil chun freastal ar na riachtanais oideachais agus oiliúna atá ag daoine dífhostaithe

source: Further Education and Training (FET) courses offer you an opportunity to develop or upgrade your skills in the commercial and industrial sectors if you are unemployed or redundant
ga: Tugann cúrsaí Breisoideachais agus Oiliúna (FET) deis duit do chuid scileanna a fhorbairt nó a uasghrádú sna hearnálacha tráchtála agus tionsclaíocha má tá tú dífhostaithe nó iomarcach

source: You can search online for training courses
ga: Is féidir leat cuardach a dhéanamh ar líne le haghaidh cúrsaí oiliúna

source: Traineeships offer you a mixture of on-the-job training with an employer and off-the job training in a training centre
ga: Cuireann cúrsaí oiliúna meascán d'oiliúint ar an láthair le fostóir chomh maith le hoiliúint lasmuigh den láthair oibre san Ionad Oiliúna duit

source: You can take part in a course if you are either a first-time jobseeker or unemployed
ga: Is féidir leat páirt a ghlacadh i gcúrsa má tá tú ag cuardach poist don chéad uair nó má tá tú dífhostaithe

source: Local training initiatives provide full-time work experience and training which is run by local community groups
ga: Soláthraíonn tionscnaimh oiliúna áitiúla taithí oibre agus oiliúint lánaimseartha atá á reáchtáil ag grúpaí pobail áitiúla

source: Community Training Centres are independent community-based organisations
ga: Is eagraíochtaí neamhspléach pobal-bhunaithe iad na hIonaid Oiliúna Pobail

source: They look after the training and employment needs of early school leavers, primarily aged between 16 and 21
ga: Tugann siad aire do na riachtanais oiliúna agus fostaíochta atá ag daoine atá tar éis an scoil a fhágáil go luath, go príomha idir 16 agus 21 bliain

source: If you are between 15 and 20 years of age and have left school without any formal qualifications, the Youthreach programme will provide you with opportunities for basic education, personal development, vocational training and work experience
ga: Má tá tú idir 15 agus 20 bliana d’aois agus má tá tú tar éis an scoil a fhágáil gan cháilíochtaí foirmiúla ar bith, tugann an clár Youthreach deiseanna duit oideachas bunúsach, forbairt phearsanta, gairmoiliúint agus taithí oibre a fháil

source: Agencies such as Fáilte Ireland, Bord Iascaigh Mhara (BIM), Teagasc, Coillte and the Crafts Council of Ireland offer you a range of specialist courses in their specific areas of work
ga: Tugann gníomhaireachtaí cosúil le Fáilte Ireland, Bord Iascaigh Mhara (BIM), Teagasc, Coillte agus Comhairle Ceardaíochta na hÉireann raon cúrsaí speisialta duit ina gcuid réimsí oibre féin

source: Other organisations such as Centres for the Unemployed, Family Resource Centres and Local Development Companies also provide training
ga: Soláthraíonn eagraíochtaí eile cosúil le hIonaid do Dhaoine Dífhostaithe, le hIonad Acmhainní Teaghlaigh agus le Cuideachtaí Forbartha Áitiúla oiliúint freisin

source: Skillnets networks offer some training to eligible unemployed people
ga: Cuireann líonraí Skillnets roinnt oiliúint ar fáil do dhaoine dífhostaithe incháilithe

source: If you are unemployed you will not pay for this training
ga: Má tá tú dífhostaithe ní íocfaidh tú as an oiliúint seo

source: You can search for training courses on the Skillnets website
ga: Is féidir leat cuardach a dhéanamh ar chúrsaí oiliúna ar láithreán gréasáin Skillnets

source: Training and work experience
ga: Oiliúint agus taithí oibre

source: The JobBridge, National Internship Scheme is aimed at unemployed people who have been either getting a jobseeker's payment or signing for credits for at least 3 months
ga: Tá an JobBridge, an Scéim Intéirneachta Náisiúnta dírithe ar dhaoine dífhostaithe ag fáil íocaíochta cuardaitheora poist nó ag síniú i gcomhair creidmheasanna ar feadh 3 mhí ar a laghad.

source: The Work Placement Programme offers work experience and you may be able to keep your social welfare payment
ga: Cuireann Socrúcháin Oibre taithí oibre ar fáil, agus d'fhéadfá a bheith in ann d'íocaíocht leasa shóisialaigh a choimeád

source: Employment schemes such as Community Employment and Tús provide short-term work opportunities for unemployed people
ga: Soláthráíonn scéimeanna fostaíochta, mar shample, Fostaíochta Pobail agus Tús deiseanna oibre gearrthéarmach do dhaoine dífhostaithe

source: You can read more in our document, Schemes to support employment
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméad, Scéimeanna chun tacú le fostaíocht
